test/checkSetbox100x100/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            patch;
        nFaces          2500;
        startFace       71500;
    }
    bottom
    {
        type            patch;
        nFaces          2500;
        startFace       74000;
    }
    inlet
    {
        type            patch;
        nFaces          500;
        startFace       76500;
    }
    outlet
    {
        type            patch;
        nFaces          500;
        startFace       77000;
    }
    front
    {
        type            patch;
        nFaces          500;
        startFace       77500;
    }
    back
    {
        type            patch;
        nFaces          500;
        startFace       78000;
    }
)

// ************************************************************************* //
