test/checkSetbox100x100/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (  0.0  0.0  0.0 )
    ( 50.0  0.0  0.0 )
    ( 50.0 10.0  0.0 )
    (  0.0 10.0  0.0 )
    (  0.0  0.0 50.0 )
    ( 50.0  0.0 50.0 )
    ( 50.0 10.0 50.0 )
    (  0.0 10.0 50.0 )
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 10 50) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    bottom
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    front
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

    back
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
